In [1]:
import sqlite3
import pandas as pd

conn = sqlite3.connect(r"C:\Users\souvi\Downloads\mental_health.sqlite")

tables = pd.read_sql(
    "SELECT name FROM sqlite_master WHERE type='table';",
    conn
)



tables

       name
0    Answer
1  Question
2    Survey

In [2]:
pd.read_sql("""SELECT count(*)as total,sum(case when AnswerText is null then 1 else 0 end ) as missing_num,
SUM(CASE WHEN AnswerText IS NULL THEN 1 ELSE 0 END) / COUNT(*) AS missing_pct
FROM Answer""", conn)

    total  missing_num  missing_pct
0  236898            0            0

In [3]:
pd.read_sql("select count(*) as total_response from answer;", conn)

   total_response
0          236898

In [4]:
pd.read_sql("select * from answer;", conn)

                AnswerText  SurveyID  UserID  QuestionID
0                       37      2014       1           1
1                       44      2014       2           1
2                       32      2014       3           1
3                       31      2014       4           1
4                       31      2014       5           1
...                    ...       ...     ...         ...
236893               Other      2016    2689         117
236894             Support      2016    2690         117
236895  Back-end Developer      2016    2691         117
236896     DevOps/SysAdmin      2016    2692         117
236897               Other      2016    2693         117

[236898 rows x 4 columns]

In [5]:
pd.read_sql("""SELECT * from (select a.*,row_number() over(partition by UserID,QuestionID order by AnswerText )as rn FROM Answer a)t  where rn>1""", conn)

,AnswerText,SurveyID,UserID,QuestionID,rn
0,"Mood Disorder (Depression, Bipolar Disorder, etc)",2016,1262,115,2
1,Front-end Developer,2016,1262,117,2
2,"Mood Disorder (Depression, Bipolar Disorder, etc)",2016,1264,115,2
3,Stress Response Syndromes,2016,1265,115,2
4,Dev Evangelist/Advocate,2016,1265,117,2
...,...,...,...,...,...
2253,"Mood Disorder (Depression, Bipolar Disorder, etc)",2016,2692,115,2
2254,Stress Response Syndromes,2016,2692,115,3
2255,"Eating Disorder (Anorexia, Bulimia, etc)",2016,2693,115,2
2256,"Mood Disorder (Depression, Bipolar Disorder, etc)",2016,2693,115,3
2257,Obsessive-Compulsive Disorder,2016,2693,115,4

In [6]:
pd.read_sql("""SELECT AnswerText,QuestionID,count(*) from Answer group by QuestionID"""  , conn)

                       AnswerText  QuestionID  count(*)
0                              37           1      4218
1                          Female           2      4218
2                   United States           3      4218
3                        Illinois           4      4218
4                              -1           5      4218
..                            ...         ...       ...
100  No, I don't think they would         114      1433
101                            -1         115      2072
102                            -1         116      1793
103            Back-end Developer         117      2692
104                     Sometimes         118      1433

[105 rows x 3 columns]

In [16]:
pd.read_sql("""SELECT * from Answer where "AnswerText" ='' and "SurveyID" ='' and "UserID" ='' """  , conn)

Empty DataFrame
Columns: [AnswerText, SurveyID, UserID, QuestionID]
Index: []

In [18]:
pd.read_sql("""SELECT *
FROM Answer
WHERE AnswerText IS NOT NULL
  AND SurveyID IS NOT NULL
  AND UserID IS NOT NULL;"""  , conn)

                AnswerText  SurveyID  UserID  QuestionID
0                       37      2014       1           1
1                       44      2014       2           1
2                       32      2014       3           1
3                       31      2014       4           1
4                       31      2014       5           1
...                    ...       ...     ...         ...
236893               Other      2016    2689         117
236894             Support      2016    2690         117
236895  Back-end Developer      2016    2691         117
236896     DevOps/SysAdmin      2016    2692         117
236897               Other      2016    2693         117

[236898 rows x 4 columns]

In [25]:
pd.read_sql("""SELECT "SurveyID" as year,COUNT(*) AS response_count
FROM Answer GROUP BY SurveyID

   ;"""  , conn)

   year  response_count
0  2014           32760
1  2016           88238
2  2017           57456
3  2018           31692
4  2019           26752